---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.IndexTriangle.Index1
source: html/89098d38-efb7-d950-ec86-f5dea28312f1.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexTriangle.Index1 Property

The index of the triangle's second vertex.

## Syntax (C#)
```csharp
public int Index1 { get; set; }
```